class HangmanVisualizer:
    """Визуализатор для игры Виселица"""
    @property
    def visualizer(self):
        _HANGMAN_STAGES = [
    """
------
|    |
|    O
|   /|\\
|   / \\
|    
----------
""",
    """
------
| 
|    
|    O
|   /|\\
|   / \\
----------
""",
    """
---
| 
|    
|    O
|   /|\\
|   / \\
----------
""",
    """
    
    
|    
|    O
|   /|\\
|   / \\
----------
""",
    """
    
    
           
|    O
|   /|\\
|   / \\
----------
""",
    """
    
              
               
     O
    /|\\
|   / \\
----------
""",
    """
                 
                
            
     O
    /|\\
    / \\
----------
"""
]
        return _HANGMAN_STAGES


